# DomainType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..DomainType Property
FabricationPart Class See Also
---
The domain type for the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ConnectorDomainType DomainType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DomainType As ConnectorDomainType
	Get
```

Visual C++
---
```text
public:
property ConnectorDomainType DomainType {
	ConnectorDomainType get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace